{
  "e-commerce-application": {
    "title": "Verdant Online Store",
    "description": "Developed a highly scalable and secure e-commerce platform using Angular and .NET Core (C#). Implemented JWT authentication with guards and interceptors, integrated Razorpay for payments, and designed a responsive UI optimized for both desktop and mobile using Bootstrap. Utilized Entity Framework for efficient ORM to manage database interactions.",
    "technologies": [
      "Angular",
      ".NET Core (C#)",
      "Azure",
      "JWT Authentication",
      "Razorpay",
      "Bootstrap",
      "SQL Server",
      "GitHub",
      "Vercel",
      "Entity Framework"
    ],
    "keyFeatures": [
      "Developed secure JWT authentication with role-based access for a safe user experience",
      "Integrated Razorpay for seamless payment processing and session security",
      "Created a dynamic admin dashboard to simplify product and order management",
      "Designed a responsive, mobile-first UI using Bootstrap, ensuring accessibility across devices",
      "Deployed on Azure with SQL Database for scalability and reliability",
      "Cart functionality for adding, updating, and removing items",
      "Version control using GitHub",
      "Database management using Entity Framework for seamless ORM operations"
    ],
    "screenshots": [
      "/assets/ecomm-1.png",
      "/assets/ecomm-2.png",
      "/assets/ecomm-3.png",
      "/assets/ecomm-4.png"
    ],
    "techStackIcons": [
      "/assets/angular-logo.png",
      "/assets/dotnet-logo.png",
      "/assets/azure-logo.png",
      "/assets/jwt-logo.png",
      "/assets/razorpay-logo.png",
      "/assets/bootstrap-logo.png",
      "/assets/sql-logo.png",
      "/assets/github.png",
      "/assets/vercel-logo.png"
    ],
    "link": "https://github.com/meghanan266/Verdant-online-store"
  },
  "image-processing-application": {
    "title": "Image Processing Application",
    "description": "Designed and implemented a robust Java-based application for advanced image processing. The project showcases proficiency in software design patterns, modular architecture, and testing practices. It includes both a user-friendly GUI built with Swing and a flexible command-line interface for advanced scripting.",
    "technologies": [
      "Java",
      "Swing",
      "JUnit Testing",
      "MVC Architecture",
      "Object-Oriented Programming (OOP)",
      "Design Patterns",
      "Command-Line Interface (CLI)"
    ],
    "keyFeatures": [
      "Modular design using MVC architecture and SOLID principles for maintainability and scalability",
      "Support for GUI (Swing) and CLI workflows",
      "Advanced image processing capabilities: filtering, transformations, histogram generation, image splitting/combination",
      "Applied TDD (Test-Driven Development) methodologies with JUnit ensuring reliability and robust error handling",
      "Clean and reusable code leveraging OOP principles and design patterns"
    ],
    "screenshots": [
      "/assets/img-process-1.png",
      "/assets/img-process-2.png"
    ],
    "techStackIcons": [
      "/assets/java-logo.png",
      "/assets/swing-logo.jpg",
      "/assets/junit-logo.png"
    ]
  },
  "portfolio-website": {
    "title": "Portfolio Website",
    "description": "Developed a modern, interactive portfolio website using React and Tailwind CSS, optimized with Vite for efficient builds and fast development. This project showcases a deep understanding of frontend development, component-based architecture, and responsive design.",
    "technologies": [
      "React",
      "Tailwind CSS",
      "Vite",
      "JavaScript",
      "HTML5",
      "CSS3",
      "GitHub",
      "Vercel"
    ],
    "keyFeatures": [
      "Developed modular and reusable components in React for a scalable frontend architecture",
      "Implemented dynamic routing using React Router for seamless navigation across multiple pages",
      "Managed state and side effects efficiently with React's useState and useEffect hooks",
      "Designed and implemented a responsive UI using Tailwind CSS, ensuring cross-device compatibility",
      "Integrated a functional contact form with validation for collecting user inquiries",
      "Hosted and deployed the application on Vercel with continuous integration from GitHub"
    ],
    "techStackIcons": [
      "/assets/react-logo.png",
      "/assets/tailwind-logo.jpg",
      "/assets/vite-logo.jpg",
      "/assets/javascript-logo.png",
      "/assets/html-logo.png",
      "/assets/css-logo.png",
      "/assets/github.png",
      "/assets/vercel-logo.png"
    ],
    "link": "https://meghana-narayana-portfolio.vercel.app/"
  },
  "food-donation": {
    "title": "Food Bridge Application",
    "description": "Designed and developed a full-stack web application to reduce food waste by connecting donors with surplus food to recipients in need. Built with Angular, Flask, and MySQL, it features a responsive user interface, secure APIs, and database management, with a focus on societal impact and technical excellence.",
    "technologies": [
      "Angular",
      "Flask",
      "MySQL",
      "Python"
    ],
    "keyFeatures": [
      "Designed and developed a responsive frontend using Angular and Angular Material.",
      "Built RESTful APIs with Flask for efficient data exchange and integration with MySQL.",
      "Implemented a normalized MySQL database schema with triggers, stored procedures, and event scheduling.",
      "Developed automated tasks to manage food post expirations and donor reward updates."
    ],
    "screenshots": [
      "/assets/food-1.png",
      "/assets/food-2.png",
      "/assets/food-3.png",
      "/assets/food-4.png"
    ],
    "techStackIcons": [
      "/assets/angular-logo.png",
      "/assets/flask-logo.png",
      "/assets/mysql-logo.png",
      "/assets/python-logo.jpg"
    ]
  },
  "career-link": {
    "title": "CareerLink Web Application",
    "description": "CareerLink is a full-stack platform designed to streamline job searches and employer outreach. It offers secure, role-based access for employers and job seekers, advanced job filtering, and AI-driven resume feedback using Google’s Gemini API. Built for performance, clarity, and scale.",
    "technologies": [
      "React.js",
      "Material UI",
      "Node.js",
      "Express.js",
      "PostgreSQL",
      "Prisma",
      "Google AI Studio API",
      "Cloudinary",
      "JavaScript",
      "Vercel"
    ],
    "keyFeatures": [
      "Implemented token-based authentication with HTTP-only cookies for secure user sessions",
      "Designed Role-Based Access Control (RBAC) for employers (job posting dashboard) and job seekers (application tracking)",
      "Built advanced job filtering by location, salary range, and skills using dynamic query logic",
      "Integrated Google AI Studio (Gemini 2.0 Flash) for AI-powered resume analysis and feedback generation",
      "Configured secure resume upload and storage via Cloudinary for fast access and retrieval",
      "Developed RESTful APIs using Node.js and Express, and managed relational data with PostgreSQL and Prisma ORM",
      "Deployed the frontend on Vercel with CI/CD from GitHub for a seamless DevOps workflow"
    ],
    "techStackIcons": [
      "/assets/react-logo.png",
      "/assets/material.png",
      "/assets/node-js.png",
      "/assets/express.png",
      "/assets/Postgresql.png",
      "/assets/prisma.png",
      "/assets/Google_ai_studio_logo.png",
      "/assets/Cloudinary.jpg",
      "/assets/javascript-logo.png"
    ],
    "screenshots": [
      "/assets/career-1.png",
      "/assets/career-2.png",
      "/assets/career-3.png",
      "/assets/career-4.png"
    ],
    "link": "https://github.com/NEU-CS5610-2025-ONL-SPRING/final-project-part-2-career-link"
  }
}